lwhsu/freebsd-doc-old-translation/ja_JP.eucJP/man/man8/editmap.8
.\" Copyright (c) 2000-2001, 2003 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     $Id: editmap.8,v 1.9 2003/02/01 17:07:42 ca Exp $
.\" $FreeBSD$
.\"
.TH EDITMAP 8 "$Date: 2003/02/01 17:07:42 $"
.SH 名称
.B editmap
\- sendmail 用のデータベースマップから 1 件のレコードの問い合わせと編集を行う
.SH 書式
.B editmap
.RB [ \-C
.IR file ]
.RB [ \-N ]
.RB [ \-f ]
.RB [ \-q|\-u|\-x ]
maptype mapname
key [ "value ..." ]
.SH 解説
.B editmap 
は sendmail(8) が参照するキー付きデータベースマップを使って、
1 件のレコードの問い合わせと編集を行います。
引数はコマンドラインから読み込まれ、(問い合わせの結果の) 出力は標準出力に
出力されます。
.PP
コンパイル方法に依存しますが、
.B editmap
は最大 3 種類の異なるデータベースフォーマットを以下の 
.I maptype 
パラメータによって選択し操作します。
.TP
dbm
DBM フォーマットマップ。
これには
ndbm(3) 
ライブラリが必要です。
.TP
btree
B-Tree フォーマットマップ。
これには新しい Berkley DB 
ライブラリが必要です。
.TP
hash
Hash フォーマットマップ。
これには新しい Berkley DB 
ライブラリが必要です。
.PP
.I TrustedUser
オプションが sendmail の設定ファイルで設定され、
.B editmap
が root によって起動された場合、生成されたファイルは 
.IR TrustedUser 
で指定されたユーザの所有になります。
.SS フラグ 
.TP
.B \-C
TrustedUser オプションの検索に、指定された 
.B sendmail 
の設定ファイルを使用します。
.TP
.B \-N
マップでの文字列の終端記号として、ヌル文字も含めます(別名マップでも)。
.TP
.B \-f
通常、キーのすべての大文字は小文字に変換されて扱われますが、
このフラグによって変換されなくなります。
これは
sendmail.cfでの
.B K
行の
\-f フラグ
に一致するようにしてください。
値の大小文字が変換されることはありません。
.TP
.B \-q
指定したキーについて問い合わせを行います。
もし見つかった場合には、値を標準出力に出力し、値 0 で終了します。
もし見つからなかった場合には、エラーメッセージを標準出力に出力して、 
EX_UNAVAILABLE で終了します。
.TP
.B \-u
.I key 
のレコードの
.I value 
を更新します。その key がない場合、新しいレコードを登録します。
成功した場合には値 0 で終了し、失敗した場合には EX_IOERR で終了します。
.TP
.B \-x
指定したキーをマップから削除します。
成功した場合には値 0 で終了し、失敗した場合には EX_IOERR で終了します。
.TP
.SH 関連項目
sendmail(8), 
makemap(8)
.SH 歴史
.B editmap 
コマンドにはまだ歴史がありません。
